# IsCompatibleWith Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..IsCompatibleWith Method
FabricationService Class See Also
---
Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsCompatibleWith(
	FabricationService otherService
)
```

Visual Basic
---
```text
Public Function IsCompatibleWith ( _
	otherService As FabricationService _
) As Boolean
```

Visual C++
---
```text
public:
bool IsCompatibleWith(
	FabricationService^ otherService
)
```

# ### Parameters
otherService
    Type: Autodesk.Revit.DB..::..FabricationService
# ### Return Value
Returns true if the services are compatible.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace